import { AwardStarIcon, ChecklistIcon, DeliveryCheckIcon, MoneyIcon, UserSearchIcon, WorkerIcon } from '@/shared/ui'

export const ADVANTAGES = {
  id: 'advantages',
  title: 'Наши преимущества',
  items: [
    {
      id: 'assortment',
      icon: ChecklistIcon,
      title: 'Тротуарная плитка от производителя в широком ассортименте',
      text: 'На сайте вы сможете подобрать прессованную, вибролитую или фасадную плитку, блоки и бордюры, водостоки, крышки на столбы и многое другое.',
    },
    {
      id: 'service',
      icon: UserSearchIcon,
      title: 'Высокий уровень сервиса обслуживания',
      text: 'Наши менеджеры всегда вежливые и профессиональные в работе с клиентами, они готовы помочь с выбором нужной модели и ответить на все вопросы клиента.',
    },
    {
      id: 'installation',
      icon: WorkerIcon,
      title: 'Услуги команды опытных специалистов по монтажу',
      text: 'Наша компания предлагает услуги профессиональной укладки и другие работы по благоустройству частных территорий.',
    },
    {
      id: 'delivery',
      icon: DeliveryCheckIcon,
      title: 'Быстрая и удобная доставка',
      text: 'Развоз заказов осуществляется при помощи спецтехники — манипулятора, облегчающего процесс погрузки и разгрузки, по Волоколамскому, Лотошинскому, Шаховскому району, Истре, Клину, Рузе.',
    },
    {
      id: 'price',
      icon: MoneyIcon,
      title: 'Демократичная стоимость',
      text: 'Если вы хотите подобрать и купить тротуарную плитку по наиболее выгодной цене в регионе — вам однозначно в «Мастер Строй»! У нас всегда первая цена напрямую от производителя!',
    },
    {
      id: 'quality',
      icon: AwardStarIcon,
      title: 'Безупречный контроль качества продукции',
      text: 'Все материалы соответствуют техническим нормам ГОСТа, а тщательный контроль позволяет исключить риск попадания брака в партию.',
    },
  ],
}
